taskt/Core/Automation/Commands/WindowGroup/GetProcessNamesFromWindowNamesAsListCommand.dot
digraph "GetProcessNamesFromWindowNamesAsListCommand" {
"GetProcessNamesFromWindowNamesAsListCommand" -> "GetFromWindowNamesAsListCommands";
"GetFromWindowNamesAsListCommands" -> "AWindowNamesCommands";
"GetFromWindowNamesAsListCommands" -> "ICanHandleList";
"AWindowNamesCommands" -> "AWindowNameCoreCommands";
"AWindowNamesCommands" -> "IWindowNamesProperties";
"AWindowNamesCommands" -> "ICanHandleList";
"AWindowNameCoreCommands" -> "ScriptCommand";
"AWindowNameCoreCommands" -> "IWindowNameCoreProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
