taskt/Core/Automation/Commands/WindowGroup/GetProcessNamesFromWindowNamesAsListCommand.puml
@startuml
GetProcessNamesFromWindowNamesAsListCommand --> GetFromWindowNamesAsListCommands
GetFromWindowNamesAsListCommands --> AWindowNamesCommands
GetFromWindowNamesAsListCommands --> ICanHandleList
AWindowNamesCommands --> AWindowNameCoreCommands
AWindowNamesCommands --> IWindowNamesProperties
AWindowNamesCommands --> ICanHandleList
AWindowNameCoreCommands --> ScriptCommand
AWindowNameCoreCommands --> IWindowNameCoreProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
